## Staging: load_testing
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 0 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                NAME                |
|----------|------------------------------------|
| recreate | `aws_lambda_function.load_testing` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_lambda_function.load_testing must be replaced
-/+ resource "aws_lambda_function" "load_testing" {
      ~ architectures                  = [
          - "x86_64",
        ] -> (known after apply)
      ~ arn                            = "arn:aws:lambda:ca-central-1:687401027353:function:LoadTesting" -> (known after apply)
      ~ function_name                  = "LoadTesting" -> "load-testing" # forces replacement
      ~ id                             = "LoadTesting" -> (known after apply)
      ~ image_uri                      = "687401027353.dkr.ecr.ca-central-1.amazonaws.com/load_test:latest" -> ":latest"
      ~ invoke_arn                     = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:687401027353:function:LoadTesting/invocations" -> (known after apply)
      ~ last_modified                  = "2024-01-26T18:26:40.000+0000" -> (known after apply)
      - layers                         = [] -> null
      ~ qualified_arn                  = "arn:aws:lambda:ca-central-1:687401027353:function:LoadTesting:$LATEST" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:687401027353:function:LoadTesting:$LATEST/invocations" -> (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      ~ source_code_hash               = "fa577303c0f922f7b8b7394b1761926bcaf207e13af2e539d714afc4ca3cbb00" -> (known after apply)
      ~ source_code_size               = 0 -> (known after apply)
      - tags                           = {} -> null
      ~ version                        = "$LATEST" -> (known after apply)
        # (9 unchanged attributes hidden)

      - ephemeral_storage {
          - size = 512 -> null
        }

      - logging_config {
          - log_format = "Text" -> null
          - log_group  = "/aws/lambda/LoadTesting" -> null
        }

        # (2 unchanged blocks hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.load_test_lambda"]
WARN - plan.json - main - Missing Common Tags: ["aws_lambda_function.load_testing"]

21 tests, 19 passed, 2 warnings, 0 failures, 0 exceptions

```

</details>
